Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.4.57/samg53/svd/ATSAMG53N19.svd
            <register>
               <name>NVICIP99</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000363</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI99</name>
                     <description>Priority of interrupt 99</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP100</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000364</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI100</name>
                     <description>Priority of interrupt 100</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP101</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000365</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI101</name>
                     <description>Priority of interrupt 101</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP102</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000366</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI102</name>
                     <description>Priority of interrupt 102</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP103</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000367</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI103</name>
                     <description>Priority of interrupt 103</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP104</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000368</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI104</name>
                     <description>Priority of interrupt 104</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP105</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000369</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI105</name>
                     <description>Priority of interrupt 105</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICSTIR</name>
               <description>Software Trigger Interrupt Register</description>
               <addressOffset>0x00000e00</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>MPU</name>
         <description>Memory Protection Unit Registers</description>
         <groupName>MPU</groupName>
         <prependToName>MPU_</prependToName>
         <baseAddress>0xE000ED90</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x14</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>TYPE</name>
               <description>MPU Type Register</description>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>SEPARATE</name>
                     <description>Indicates support for unified or separate instruction and date memory maps.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DREGION</name>
                     <description>Indicates the number of supported MPU instruction regions.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IREGION</name>
                     <description>Indicates the number of supported MPU data regions.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL</name>
               <description>MPU Control Register</description>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enables the MPU</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HFNMIENA</name>
                     <description>Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVDEFENA</name>
                     <description>Enables privileged software access to the default memory map.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNR</name>
               <description>MPU Region Number Register</description>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REGION</name>
                     <description>Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RBAR</name>
               <description>MPU Region Base Address Register</description>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REGION</name>
                     <description>MPU region field.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VALID</name>
                     <description>MPU Region Number valid bit.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>Region base address field.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>27</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RASR</name>
               <description>MPU Region Attribute and Size Register</description>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Region enable bit.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Specifies the size of the MPU protection region.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SRD</name>
                     <description>Subregion disable bits.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>B</name>
                     <description>MPU access permission attributes.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C</name>
                     <description>MPU access permission attributes.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S</name>
                     <description>Shareable bit.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEX</name>
                     <description>MPU access permission attributes.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>AP</name>
                     <description>Access permission field.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>XN</name>
                     <description>Instruction access disable bit.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
   </peripherals>
</device>
